#include <iostream>
#include <algorithm>


using namespace std;

const int N = 10000010;
int t,m;
int T[N],V[N];
long long f[N];

int main()
{
    cin >> t >> m;
    for (int i = 0;i < m;i ++)
    {
        cin >> T[i] >> V[i];
    }

    for (int i = 0;i < m;i ++)
    {
        for (int j = T[i];j <= t;j ++)
        {
            f[j] = max(f[j],f[j-T[i]]+V[i]);
        }
    }

    cout << f[t];
    return 0;
}
/*
体积为5，物品有3个
f[0..5] = { 0,0,0,0,0}
1: 体积：2，价值3
放1:
f[5] = max(f[5],f[5-2]+3) = 3
f[4] = max(f[4],f[4-2]+3) = 3
...
f[2] = ... = 3
2:体积：3，价值：4
f[5] = max(f[5],f[5-3] + 4)

如果从小到大：
放1：
f[1],pass;
f[2] = max(f[2],f[0] + 3) = 3
f[3] = max(f[3],f[1] + 3) = 3
f[4] = max(f[4],f[2] + 3) = 6,这里1被重复放了一次，因为这里的f[2]是等价于f[4-2],
意思是我已经选了物品1让他=他占了两个体积,后面加的那个3就是他的价值,表示已经加进去了,
这里的f[2]本应是0,但是循环"从小到大"的方式让他使用了已经更新过的f[2],即之前的,这个是
另一层的数据,如果说只能放一次的话,他们要保持独立,不能互相影响,循环“从大到小”保证f[j - v[i]]
里面没有放过当前物品，即没有当前物品的数据
要知道,每一次循环都是只针对一个物品的
放2：
f[1],f[2],pass
f[3] = max(f[3],f[0] + 4) = 4
f[4] = max(f[4],f[])
*/